// pages/customer/fillInfo.js

var Bmob = require('../../utils/bmob.js');
var Province = ["北京", "天津", "河北", "山东", "山西", "陕西", "甘肃", "黑龙江", "吉林", "辽宁", "内蒙古自治区", "宁夏自治区", "青海", "新疆维吾尔自治区"];

var Citys = {
  "北京": ["北京"], 
  "甘肃": ["兰州", "天水", "庆阳", "白银", "张掖"],
  "河北": ["秦皇岛", "石家庄", "保定", "唐山", "邢台", "邯郸", "沧州", "廊坊", "张家口", "承德", "衡水"], 
  "黑龙江": ["大庆", "哈尔滨", "牡丹江市绥芬河", "齐齐哈尔", "牡丹江", "佳木斯", "绥化", "伊春", "黑河", "绥芬河"], 
  "吉林": ["长春", "延吉", "吉林", "四平", "通化", "松原"], 
  "辽宁": ["大连", "沈阳", "鞍山", "本溪", "辽阳", "阜新", "丹东", "盘锦", "锦州", "抚顺", "营口", "鞍山海城", "东港", "大石桥", "朝阳"], 
  "内蒙古自治区": ["呼和浩特", "赤峰", "鄂尔多斯", "包头", "锡林浩特", "呼伦贝尔", "临河", "乌海"], 
  "宁夏自治区": ["银川", "吴忠", "固原"], 
  "青海": ["西宁"], 
  "山东": ["聊城", "济南", "泰安", "淄博", "枣庄滕州", "临沂", "莱芜", "菏泽", "济宁", "东营", "滨州", "枣庄", "泰安肥城", "青岛", "潍坊", "日照", "烟台", "威海"], 
  "山西": ["太原", "大同", "长治", "晋城", "运城", "临汾", "朔州"], 
  "陕西": ["西安", "榆林", "渭南韩城", "渭南", "咸阳", "宝鸡", "汉中", "渭南澄城", "榆林神木"], 
  "天津": ["天津"], 
  "新疆维吾尔自治区": ["乌鲁木齐", "库尔勒", "昌吉", "新疆自治区", "哈密"]
};

var Stores = {
  "北京": ["来广营旗舰店", "北陶展厅", "居然之家丽泽店", "居然之家玉泉营店", "居然之家金源店", "居然之家北四环店", "居然之家八角店", "红星美凯龙东四环店（新增）", "居然之家大兴店", "北七家建材城店", "万家灯火沙河店（新增）", "固安昌达家居建材市场店（新增）", "集美南四环店", "集美西四环店", "集美杜家坎店", "回龙观建材城", "十里河旗舰店", "居然之家十里河店", "城外诚家居文化广场店", "居然之家顺义店", "红星美凯龙西四环店", "红星美凯龙北四环店", "红星美凯龙东五环店", "红星美凯龙北五环店", "蓝景丽家大钟寺店", "顺义国门一号全球家居", "顺义益麒麟（新增）", "燕郊集美家居（新增）", "京东运桥建材城"], 
  "兰州":["l1","l2"],
  "鞍山":	["鞍山居然之家"],
  "鞍山海城":	["海城建材市场未来生活空间旗舰店路边店"],
  "白银":	["甘肃白银TOTO卫浴店"],
  "包头":	["居然之家包头店","金荣建材城包头店"],
  "宝鸡":	["陕西宝鸡冠森TOTO专卖店"],
  "保定": ["保定红星美凯龙","保定居然之家TOTO卫浴","定州市南关街TOTO卫浴"],
  "本溪":	["本溪独立店"],
  "滨州":	["滨州银座家居店"],
  "沧州":	["红星美凯龙沧州店"],
  "昌吉":	["新疆昌吉居然之家店"],
  "朝阳":	["路边店"],
  "承德":	["承德居然之家TOTO"],
  "赤峰":	["赤峰天丰商贸城TOTO洁具店","居然之家赤峰店"],
  "大连": ["金三角居然店","大世界家居广场店","红星美凯龙大连华南店","居然之家大连店","大连幸福家居世界店","开发区名品家居店","庄河居然之家店",           "普兰店颐安家居店"],
  "大庆": ["正大方盛家居博览中心店（更改店名）","大庆居然之家店"],
  "大石桥":	["大石桥市东陶卫浴经销处路边店"],
  "大同": ["居然之家大同店","红星美凯龙大同店"],
  "丹东":	["丹东金名洋建材有限公司路边店"],
  "东港":	["东港居然之家店"],
  "东营": ["银座家居东营店","东营美亿家家居广场店"],
  "鄂尔多斯":	["居然之家鄂尔多斯店"],
  "抚顺":	["抚顺市建华陶瓷总汇红星店"],
  "阜新":	["阜新市圣金雅建材销售中心路边店"],
  "固原":	["宁夏固原金华家具广场（新增）"],
  "哈尔滨": ["先锋居然店","海城品牌广场专营店","居然之家哈尔滨店","海富专营店","居然之家群力店（新增）","居然之家哈西店（新增）"
          ,"哈尔滨华南城喜乐汇·家居直卖广场TOTO专卖店（新增）"],
  "哈密":	["新疆哈密红星美凯龙店（开业时间待定）"],
  "邯郸": ["邯郸月星家居","红星美凯龙邯郸店"],
  "汉中": ["陕西汉中运达家居建材城TOTO专卖店","汉中居然之家TOTO专卖店"],
  "菏泽": ["红星美凯龙菏泽店（新增）","菏泽市银座家居"],
  "黑河":	["黑河TOTO专卖店"],
  "衡水":	["衡水市开发区科力卫浴经销处"],
  "呼和浩特": ["金盛家居呼和浩特店","居然之家呼和浩特店","居然之家呼和浩特玉泉店","润宇市场店"],
  "呼伦贝尔":	["呼伦贝尔市海拉尔区尚品国际建材城TOTO洁具店"],
  "吉林":	["吉林市众安居店"],
  "济南": ["红星美凯龙济南店","银座家居济南中心店","银座家居北园店","北园大街旗舰店","居然之家济南北园店","济南星艺佳旗舰店（新增）"],
  "济宁":	["红星美凯龙济宁店（新增）"],
  "佳木斯":	["佳木斯东陶洁具商店"],
  "锦州":	["锦州红星TOTO店"],
  "晋城":	["居然之家晋城店","居然之家晋中店"],
  "库尔勒":	["新疆库尔勒红星美凯龙店"],
  "莱芜":	["城发家居TOTO店（新增）"],
  "兰州":	["甘肃鑫润美居兰州居然店","甘肃鑫润美居兰州兰海店","甘肃鑫润美居兰州雁滩店","甘肃鑫润美居兰州红星店"],
  "廊坊":	["红星美凯龙廊坊店","廊坊香河居然之家TOTO店"],
  "辽阳":	["辽阳欧亚达家居朔源洁具商行欧亚达商场店"],
  "聊城":	["聊城顺屹家居卫浴体验馆"],
  "临汾":	["居然之家临汾店"],
  "临河":	["红星美凯龙临河店"],
  "临沂":	["银座家居临沂店","居然之家临沂店（新增）","临沂怡景丽家国际家居广场店"],
  "牡丹江": ["牡丹江市西安区东陶洁具商店"],
  "牡丹江市绥芬河": ["居然之家海拉尔店（新增）"],
  "盘锦":	["盘锦同济家居商场店"],
  "齐齐哈尔":	["齐齐哈尔市通行街二轻装饰材料市场2门市"],
  "秦皇岛":	["秦皇岛红星美凯龙店"],
  "青岛":	["南京路旗舰店","高科园装饰城店","胶州月星家居TOTO专卖店（新增）","胶州TOTO专卖店（新增）","青岛居然之家TOTO专卖店","振华路海博TOTO专卖店","城阳红星美凯龙TOTO专卖店","红星美凯龙胶南店","青岛市黄岛海博家居店","即墨TOTO独立店"],
  "庆阳":	["甘肃庆阳TOTO卫浴店"],
  "日照":	["观海苑国际家居广场"],
  "沈阳":	["风雨坛旗舰店","居然之家营口店","红星美凯龙铁西店","东北陶瓷大世界店","红星美凯龙浑南店","居然之家浑南店（新增）","居然之家皇姑店"],
  "石家庄": ["石家庄旗舰店","怀特洁具精品城店（新增）","石家庄红星美凯龙和平东路店","石家庄红星美凯龙裕华东路店","石家庄居然之家","石家庄红星美凯龙中储TOTO卫浴","宁晋县源博陶瓷经销处"],
  "朔州":	["居然之家朔州店"],
  "四平":	["四平华生商场店"],
  "松原":	["中东瑞家松原店"],
  "绥芬河":	["绥芬河市迎泽市场陶瓷卫浴馆TOTO专卖店"],
  "绥化":	["绥化市东陶专营店"],
  "太原":	["居然之家太原坤泽店","居然之家太原河西店","居然之家太原长治路春天店","太原红星美凯龙店（新增）","太原旗舰店","太原星月家居店（新增）"],
  "泰安":	["居然之家泰安店","泰安大店光彩装饰材料城店"],
  "泰安肥城":	["肥城亿嘉建材城店"],
  "唐山":	["居然之家唐山店"],
  "天津":	["环渤海旗舰店","华北陶瓷城旗舰店","红星美凯龙河东店","环渤海建材城滨海新区店","红星美凯龙河西店","红星美凯龙红桥店","河西居然之家店","武清居然之家店","塘沽居然之家店","北辰红星美凯龙店"],
  "天水":	["甘肃鑫润美居天水居然店"],
  "通化":	["通化中东瑞家店"],
  "威海":	["威海金蚂蚁店","威海美乐乐天店","文登圣居建材装饰城"],
  "潍坊":	["潍坊红星美凯龙建材馆店（新增）","安丘东陶洁具店（新增）","高密东盛卫浴销售中心（新增）","诸城市恒丰建材经营部（新增）","青州冠华建材经营部（新增）","临朐全福元家居建材馆店（新增）","昌乐独立店（新增）","潍坊冠华陶瓷行（更换名称）","潍坊高新区东陶洁具营销中心（更换名称）"],
  "渭南":	["陕西锦昊荣发建材家居城TOTO专卖店"],
  "渭南澄城":	["陕西澄城恒云实业TOTO专卖店（新增）"],
  "渭南韩城":	["陕西韩城TOTO专卖店"],
  "乌海":	["月星家居广场乌海TOTO专卖店（待开业）"],
  "乌鲁木齐":	["新疆旗舰店","新疆美居物流园店","华凌市场店","新疆乌鲁木齐居然之家店"],
  "吴忠":	["宁夏吴忠居然之家TOTO专卖店（新增）"],
  "西安":	["西安金隅天丽大明宫钻石店","西安金隅天丽大明宫三桥店","西安金隅天丽东大明宫店","西安金隅天丽北三环大明宫店","西安金隅天丽红星美凯龙太白店","西安金隅天丽南大明宫店","西安金隅天丽北大明宫店","西安金隅天丽居然之家店","西安金隅天丽红星美凯龙方新店","西安金隅天丽居然之家南二环店","西安金隅天丽红星美凯龙辛家庙店"],
  "西宁":	["青海西宁居然之家万佳家博园店（新增）","青海西宁红星美凯龙五矿店（新增）","西宁市红星美凯龙TOTO专卖店（新增）","西宁万佳家博园独立店（新增）"],
  "锡林浩特":	["锡林浩特美家美户TOTO洁具店"],
  "咸阳":	["咸阳市居然现代TOTO专卖店","咸阳红星美凯龙TOTO专卖店"],
  "新疆自治区":	["新疆乌鲁木齐高铁站居然之家店（新增）"],
  "邢台":	["沙河市新凯龙TOTO卫浴","邢台市桥西区承旭卫浴经销处"],
  "烟台":	["海港家饰城店","海阳金达电器TOTO店","龙口市东江装饰材料市场TOTO店","烟台红星美凯龙","蓬莱独立店","居然之家招远店","烟台黄务乐天TOTO店面","牟平孙波卫浴洁具店","莱州市锡城洁具店","莱阳居然之家TOTO店"],
  "延吉":	["延吉居然之家店","延吉欧尚家居店"],
  "伊春":	["伊春东陶专卖店"],
  "银川":	["宁夏银川月星店（新增）","宁夏银川居然之家光耀店（新增）"],
  "营口":	["营口经济技术开发区新东陶卫浴店路边店"],
  "榆林":	["陕西榆林大明宫钻石店TOTO专卖店"],
  "榆林神木":	["陕西神木TOTO专卖店"],
  "运城":	["居然之家运城店"],
  "枣庄":	["枣庄居然之家店"],
  "枣庄滕州":	["滕州红星美凯龙店"],
  "张家口":	["张家口市桥东区陶陶洁具销售处"],
  "张掖":	["甘肃鑫润美居张掖居然店"],
  "长春":	["长春居然太阳城店","长春居然赛德店","长春欧亚卖场店","长春中东瑞家店"],
  "长治":	["长治居然之家","长治万博宜家苑店"],
  "淄博":	["居然之家淄博店","居然之家临淄店","红星美凯龙张店店","银座家居淄博店（新增）"]
};

Page({

  hudToast: function(title) {
    wx.showToast({
      title: title,
      icon: "none",
      duration: 2000
    })
  },

  // 填写完成
  fillSuccess: function (e) {
    var storeName = this.data.selectedStore;
    var wxlNo = this.data.selectedWxlNo;
    var cusName = e.detail.value["customerName"];
    var cusTel = e.detail.value["customerTel"];
    var isTOTO = e.detail.value["isTOTO"];
    var cardNum = e.detail.value["ticketNo"].toUpperCase();

    var nextStep = true;
    if (storeName == "点击选择" || wxlNo == "点击选择" || cusName == "" || cusTel == "" || cardNum == "") {
      nextStep = false;
      this.hudToast("请填写所有信息");
    }

    // 验证手机号码
    if (nextStep) {
      var telReg = new RegExp("^[0-9]{11}$");
      if (!telReg.test(cusTel)) {
        nextStep = false;
        this.hudToast("请填写正确的手机号码");
      }
    }

    // 验证卡号
    if (nextStep) {
      var cardReg = new RegExp("^[A-Z0-9]+$");
      if (!cardReg.test(cardNum)) {
        nextStep = false;
        this.hudToast("请填写正确的优惠卡号");
      } else {
        var Ticket = Bmob.Object.extend("Ticket");
        var query = new Bmob.Query(Ticket);
        query.equalTo("number", cardNum); // YU0956
        wx.showLoading({
          title: '正在提交数据...',
        });
        query.first({
          success: ticketObj => {
            if (ticketObj == undefined) {
              this.hudToast("卡号不存在");
            } else {
              wx.hideLoading();
              var isAble = ticketObj.get("is_able"); // 卡号是否被使用
              if (isAble == 0) {
                // 提交用户信息
                var Customer = Bmob.Object.extend("Customer");
                var customer = new Customer();
                customer.set("wxl_name", wxlNo);
                customer.set("ticket_no", cardNum);
                customer.set("telphone", cusTel);
                customer.set("store_name", storeName);
                customer.set("name", cusName);
                customer.set("is_toto", isTOTO);
                //添加数据，第一个入口参数是null
                customer.save(null, {
                  success: function (result) {
                    // 更改Ticket表中对应卡号is_able为1
                    ticketObj.set("is_able", 1);
                    ticketObj.save();
                    wx.redirectTo({
                      url: '../success/success',
                    });
                  },
                  error: (result, error) => {
                    this.hudToast("网络异常");
                  }
                });
              } else {
                this.hudToast("此卡号已经被使用");
              }
            }
          },
          error: err => {
            this.hudToast("网络异常");
          }
        });
      }
    }
  },

  // 城市选择确认
  regionPickerChange: function(e) {
    // console.log('picker发送选择改变，携带值为', e.detail.value);
    var pro = Province[e.detail.value[0]];
    var city = Citys[pro][e.detail.value[1]];
    var stores = Stores[city];
    if (stores == undefined || stores.count == 0) {
      stores = ["无店面"];
    }
    this.setData({
      selectedCity: city,
      storeArray: stores,
      selectedStore: "点击选择",
      storeIndex: [0],
    });
  },
  // 城市选择滚动
  regionPickerColumnChange: function(e) {
    // console.log('修改的列为', e.detail.column, '，值为', e.detail.value);
    if (e.detail.column == 0) {
      var newCitys = Citys[Province[e.detail.value]];
      this.setData({
        regionArray: [Province, newCitys],
        regionIndex: [e.detail.value, 0],
      });
    }
  },
  // 店面选择确认
  storePickerChange: function(e) {
    // console.log('picker发送选择改变，携带值为', e.detail.value);
    var store = this.data.storeArray[e.detail.value];
    if (store == "请先选择城市") {
      store = "点击选择";
    }
    this.setData({
      selectedStore: store
    });
  },
  // 卫洗丽型号选择确认
  wxlNoPickerChange: function (e) {
    var wxlno = this.data.wxlNoArray[e.detail.value];
    this.setData({
      selectedWxlNo: wxlno
    });
  },

  /**
   * 页面的初始数据
   */
  data: {
    // 城市
    regionArray: [Province, Citys[Province[0]]],
    regionIndex: [0, 0],
    selectedCity: "点击选择",
    // 店面
    storeArray: ["请先选择城市"],
    storeIndex: [0],
    selectedStore: "点击选择",
    // 型号
    wxlNoArray: ["TCF6631CS", "TCF6531CS","TCF6632CS","TCF6532CS"],
    wxlNoIndex: [0],
    selectedWxlNo: "点击选择",
  },

  /**
   * 生命周期函数--监听页面加载
   */
  // onLoad: function (options) {
  // },

  // /**
  //  * 生命周期函数--监听页面初次渲染完成
  //  */
  // onReady: function () {
  
  // },

  /**
   * 生命周期函数--监听页面显示
   */
  // onShow: function () {
  //   console.log("show");
  // },

  // /**
  //  * 生命周期函数--监听页面隐藏
  //  */
  // onHide: function () {
  
  // },

  // /**
  //  * 生命周期函数--监听页面卸载
  //  */
  // onUnload: function () {
  
  // },

  // /**
  //  * 页面相关事件处理函数--监听用户下拉动作
  //  */
  // onPullDownRefresh: function () {
  
  // },

  // /**
  //  * 页面上拉触底事件的处理函数
  //  */
  // onReachBottom: function () {
  
  // },

  // /**
  //  * 用户点击右上角分享
  //  */
  // onShareAppMessage: function () {
  
  // }
})